import numpy as np
import NaiveGaussian as NG
import PartialGaussian as PG
import CompleteGaussian as CG

#A = np.array([[1, 1, 1], 
#              [2, -2, 1], 
#              [-5, -4, 5]], dtype = float)
#b = np.array([[6], [1], [2]], dtype = float)

C = np.array([[0.2, 0, 0.2, 0, 0], 
              [0, 0.2, 0, 0.2, 0], 
              [0.2, 0, 0.2, 0, 0.2], 
              [0, 0.2, 0, 0.2, 0], 
              [0, 0, 0.2, 0, 0.2]])
D = np.array([[2.33, 0.81, 0.67, 0.92, -0.53], 
              [-0.53, 2.33, 0.81, 0.67, 0.92], 
              [0.92, -0.53, 2.33, 0.81, 0.67], 
              [0.67, 0.92, -0.53, 2.33, 0.81], 
              [0.81, 0.67, 0.92, -0.53, 2.33]])
k = 5
b = np.array([[4.2], [4.2], [4.2], [4.2], [4.2]])
A = k * C + D

A = np.hstack((A, b))
print("                                    Вариант 5                                     ")
print("----------------------------------------------------------------------------------")
print("Расширенная матрица A:")
print(A)
print("----------------------------------------------------------------------------------")
print("1. Метод Гаусса (схема единственного деления):")
NG.Naive_Gaussian_Elimination_Method(A)
print("----------------------------------------------------------------------------------")
print("2. Метод Гаусса с выбором главного элемента по столбцу (схема частичного выбора):")
PG.Gaussian_Elimination_with_Partial_Pivoting(A)
print("----------------------------------------------------------------------------------")
print("3. Метод Гаусса с выбором главного элемента по матрице (схема полного выбора):")
CG.Gaussian_Elimination_with_Complete_Pivoting(A)
print("----------------------------------------------------------------------------------")

A = np.array([[2, 4, 6], 
              [2, 0, -1], 
              [5, 1, -1]], dtype = float)
b = np.array([[4], [2], [1]], dtype = float)
A = np.hstack((A, b))

print("--------------------------------  ТЕСТ 1  ----------------------------------------")
print("Расширенная матрица A:")
print(A)
print("----------------------------------------------------------------------------------")
print("1. Метод Гаусса (схема единственного деления):")
NG.Naive_Gaussian_Elimination_Method(A)
print("----------------------------------------------------------------------------------")
print("2. Метод Гаусса с выбором главного элемента по столбцу (схема частичного выбора):")
PG.Gaussian_Elimination_with_Partial_Pivoting(A)
print("----------------------------------------------------------------------------------")
print("3. Метод Гаусса с выбором главного элемента по матрице (схема полного выбора):")
CG.Gaussian_Elimination_with_Complete_Pivoting(A)
print("----------------------------------------------------------------------------------")

A = np.array([[12, 10, -7], 
              [6, 5, 3], 
              [24, -1, 5]], dtype = float)
b = np.array([[15], [14], [28]], dtype = float)
A = np.hstack((A, b))

print("--------------------------------  ТЕСТ 2  ----------------------------------------")
print("Расширенная матрица A:")
print(A)
print("----------------------------------------------------------------------------------")
print("1. Метод Гаусса (схема единственного деления):")
NG.Naive_Gaussian_Elimination_Method(A)
print("----------------------------------------------------------------------------------")
print("2. Метод Гаусса с выбором главного элемента по столбцу (схема частичного выбора):")
PG.Gaussian_Elimination_with_Partial_Pivoting(A)
print("----------------------------------------------------------------------------------")
print("3. Метод Гаусса с выбором главного элемента по матрице (схема полного выбора):")
CG.Gaussian_Elimination_with_Complete_Pivoting(A)
print("----------------------------------------------------------------------------------")